09-other-libraries.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-07 Fri 19:35 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Other Libraries</title>
<meta name="author" content="modula t. worm" />
<meta name="generator" content="Org Mode" />
<link type='text/css' rel='stylesheet' href='css.css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <ol class="bar">
    <li value="0"><a href="index.html">Contents</a></li>
    <li><a href="01-introduction.html">Introduction</a></li>
    <li><a href="02-getting-started.html">Getting Started</a></li>
    <li><a href="03-make-a-sound.html">Make a Sound</a></li>
    <li><a href="04-further-soundmaking.html">Further Soundmaking</a></li>
    <li><a href="05-sampling.html">Sampling</a></li>
    <li><a href="06-sequencing.html">Sequencing</a></li>
    <li><a href="07-effects.html">Effects</a></li>
    <li><a href="08-architecture.html">Architecture</a></li>
    <li><a href="09-other-libraries.html">Other Libraries</a></li>
  </ol>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Other Libraries</h1>
</header><div id="outline-container-org0c0bf30" class="outline-2">
<h2 id="org0c0bf30"><a href="https://github.com/defaultxr/cl-patterns">cl-patterns</a></h2>
<div class="outline-text-2" id="text-org0c0bf30">
<p>
cl-patterns is a music sequencing library for Common Lisp. It is heavily inspired by the Patterns system in SuperCollider, but aims to improve upon it. A few notable differences are:
</p>

<ul class="org-ul">
<li><p>
More consistent argument order.
SuperCollider patterns:
</p>
<div class="org-src-container">
<pre class="src src-sclang"><span class="org-type">Pseq</span><span class="org-rainbow-delimiters-depth-1">(</span>list,<span class="org-whitespace-space"> </span>repeats<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">Pstutter</span><span class="org-rainbow-delimiters-depth-1">(</span>repeats,<span class="org-whitespace-space"> </span>pattern<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
cl-patterns:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>pseq<span class="org-whitespace-space"> </span>list<span class="org-whitespace-space"> </span>repeats<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>pstutter<span class="org-whitespace-space"> </span>pattern<span class="org-whitespace-space"> </span>repeats<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div></li>

<li>More introspectable and configurable.</li>

<li>Differing terminology: a SuperCollider pattern generates a <code>Stream</code> of results, while a cl-patterns pattern generates a <code>pstream</code> of outputs.</li>

<li>cl-patterns supports additional backends; for example, it can be used with SuperCollider/cl-collider, but it can also be used with Incudine.</li>
</ul>

<p>
See cl-patterns' <a href="https://github.com/defaultxr/cl-patterns/blob/master/doc/sc-differences.org">sc-differences.org</a> for more ways it differs from SuperCollider's patterns.
</p>
</div>
</div>
<div id="outline-container-org0e40b84" class="outline-2">
<h2 id="org0e40b84"><a href="https://incudine.sourceforge.net/">Incudine</a></h2>
<div class="outline-text-2" id="text-org0e40b84">
<p>
Incudine is a music and digital signal processing programming environment for Common Lisp. It is similar to SuperCollider in that it is a real time audio synthesis server with a large feature set, however it also differs from SC in several ways. Here are a few examples:
</p>

<ul class="org-ul">
<li>Designed from the start to be used with Common Lisp.</li>
<li>Allows user-definable "virtual UGens" to be written in Common Lisp. cl-collider supports "embeddable synthdefs" functionality, which is similar.</li>
<li>Differing terminology: for example, what SuperCollider calls "SynthDefs", Incudine calls "DSPs".</li>
<li>Built-in LV2 (Linux audio plugin) support.</li>
<li>Built-in LADSPA (Linux audio plugin) support. SuperCollider requires the sc3-plugins package to be installed for this.</li>
<li>Built-in FluidSynth (soundfont) support.</li>
<li>GPL 2.0 license instead of GPL 3.0.</li>
</ul>

<p>
<a href="08-architecture.html">Previous: Architecture</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-12-21 Thu 18:48. Updated: 2025-02-07 Fri 19:35.</p>
</div>
</body>
</html>
